loadtest/replication-non-quorum.out
Initialised 2 threads in 0 ms.
Running 30s test @ http://host.docker.internal:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 2.807ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.779ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.87ms    1.51ms  25.20ms   87.77%
    Req/Sec   108.25    113.32   600.00     88.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.77ms
 75.000%    3.42ms
 90.000%    4.03ms
 99.000%    7.13ms
 99.900%   22.14ms
 99.990%   25.21ms
 99.999%   25.21ms
100.000%   25.21ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.445     0.000000            1         1.00
       1.556     0.100000          390         1.11
       1.914     0.200000          780         1.25
       2.205     0.300000         1170         1.43
       2.465     0.400000         1564         1.67
       2.765     0.500000         1950         2.00
       2.905     0.550000         2150         2.22
       3.029     0.600000         2340         2.50
       3.145     0.650000         2535         2.86
       3.283     0.700000         2733         3.33
       3.417     0.750000         2927         4.00
       3.491     0.775000         3025         4.44
       3.563     0.800000         3121         5.00
       3.649     0.825000         3219         5.71
       3.753     0.850000         3315         6.67
       3.875     0.875000         3413         8.00
       3.939     0.887500         3465         8.89
       4.025     0.900000         3510        10.00
       4.115     0.912500         3561        11.43
       4.223     0.925000         3608        13.33
       4.379     0.937500         3657        16.00
       4.451     0.943750         3682        17.78
       4.571     0.950000         3705        20.00
       4.699     0.956250         3730        22.86
       4.831     0.962500         3754        26.67
       4.927     0.968750         3779        32.00
       5.055     0.971875         3791        35.56
       5.147     0.975000         3803        40.00
       5.275     0.978125         3815        45.71
       5.491     0.981250         3827        53.33
       5.743     0.984375         3840        64.00
       5.935     0.985938         3847        71.11
       6.131     0.987500         3852        80.00
       6.791     0.989062         3858        91.43
       7.503     0.990625         3864       106.67
       8.431     0.992188         3870       128.00
       9.351     0.992969         3873       142.22
       9.999     0.993750         3876       160.00
      11.039     0.994531         3879       182.86
      11.615     0.995313         3883       213.33
      13.855     0.996094         3885       256.00
      15.183     0.996484         3887       284.44
      15.991     0.996875         3888       320.00
      16.135     0.997266         3890       365.71
      16.271     0.997656         3891       426.67
      18.111     0.998047         3893       512.00
      19.007     0.998242         3894       568.89
      19.007     0.998437         3894       640.00
      20.079     0.998633         3895       731.43
      22.143     0.998828         3896       853.33
      22.255     0.999023         3897      1024.00
      22.255     0.999121         3897      1137.78
      22.255     0.999219         3897      1280.00
      22.351     0.999316         3898      1462.86
      22.351     0.999414         3898      1706.67
      22.719     0.999512         3899      2048.00
      22.719     0.999561         3899      2275.56
      22.719     0.999609         3899      2560.00
      22.719     0.999658         3899      2925.71
      22.719     0.999707         3899      3413.33
      25.215     0.999756         3900      4096.00
      25.215     1.000000         3900          inf
#[Mean    =        2.873, StdDeviation   =        1.505]
#[Max     =       25.200, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 516.57KB read
Requests/sec:    200.04
Transfer/sec:     17.22KB