loadtest/replication-quorum.out
Initialised 2 threads in 1 ms.
Running 30s test @ http://host.docker.internal:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 3.123ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 8.256ms, rate sampling interval: 26ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.73ms    2.62ms  21.33ms   67.62%
    Req/Sec   106.71    227.54     1.92k    97.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.11ms
 75.000%    6.59ms
 90.000%    8.38ms
 99.000%   11.66ms
 99.900%   19.70ms
 99.990%   21.34ms
 99.999%   21.34ms
100.000%   21.34ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.446     0.000000            1         1.00
       1.817     0.100000          390         1.11
       2.457     0.200000          781         1.25
       2.981     0.300000         1171         1.43
       3.459     0.400000         1562         1.67
       4.107     0.500000         1950         2.00
       4.527     0.550000         2146         2.22
       4.971     0.600000         2340         2.50
       5.371     0.650000         2536         2.86
       5.975     0.700000         2732         3.33
       6.591     0.750000         2927         4.00
       6.823     0.775000         3023         4.44
       7.095     0.800000         3121         5.00
       7.367     0.825000         3220         5.71
       7.663     0.850000         3317         6.67
       7.967     0.875000         3413         8.00
       8.231     0.887500         3464         8.89
       8.375     0.900000         3511        10.00
       8.607     0.912500         3559        11.43
       8.815     0.925000         3610        13.33
       9.079     0.937500         3660        16.00
       9.207     0.943750         3684        17.78
       9.335     0.950000         3705        20.00
       9.447     0.956250         3730        22.86
       9.623     0.962500         3754        26.67
       9.887     0.968750         3779        32.00
      10.079     0.971875         3791        35.56
      10.191     0.975000         3803        40.00
      10.383     0.978125         3815        45.71
      10.663     0.981250         3827        53.33
      10.935     0.984375         3840        64.00
      11.207     0.985938         3846        71.11
      11.351     0.987500         3852        80.00
      11.543     0.989062         3858        91.43
      11.751     0.990625         3864       106.67
      12.215     0.992188         3870       128.00
      12.327     0.992969         3873       142.22
      12.655     0.993750         3876       160.00
      12.799     0.994531         3880       182.86
      12.903     0.995313         3882       213.33
      13.239     0.996094         3885       256.00
      13.391     0.996484         3887       284.44
      13.407     0.996875         3888       320.00
      13.679     0.997266         3890       365.71
      13.783     0.997656         3891       426.67
      17.183     0.998047         3893       512.00
      18.927     0.998242         3894       568.89
      18.927     0.998437         3894       640.00
      19.503     0.998633         3895       731.43
      19.695     0.998828         3896       853.33
      19.807     0.999023         3897      1024.00
      19.807     0.999121         3897      1137.78
      19.807     0.999219         3897      1280.00
      19.935     0.999316         3898      1462.86
      19.935     0.999414         3898      1706.67
      20.383     0.999512         3899      2048.00
      20.383     0.999561         3899      2275.56
      20.383     0.999609         3899      2560.00
      20.383     0.999658         3899      2925.71
      20.383     0.999707         3899      3413.33
      21.343     0.999756         3900      4096.00
      21.343     1.000000         3900          inf
#[Mean    =        4.728, StdDeviation   =        2.618]
#[Max     =       21.328, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5902 requests in 30.01s, 496.38KB read
Requests/sec:    196.68
Transfer/sec:     16.54KB